In [12]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [13]:
password = getpass.getpass()

········

In [14]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

1. How many distinct (different) actors' last names are there?

In [15]:
query = """SELECT DISTINCT last_name AS "Different last names" FROM sakila.actor
GROUP BY last_name"""
data = pd.read_sql_query(query, engine)
data

    Different last names
0                 AKROYD
1                  ALLEN
2                ASTAIRE
3                 BACALL
4                 BAILEY
..                   ...
116              WINSLET
117          WITHERSPOON
118                 WOOD
119                 WRAY
120            ZELLWEGER

[121 rows x 1 columns]

2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [44]:
query = """SELECT rental_id, rental_date, 
       DATE_FORMAT(rental_date, 'M') AS month, 
       DATE_FORMAT(rental_date, 'W') AS weekday,
       CASE 
          WHEN WEEKDAY(rental_date) IN (5,6) THEN 'weekend'
          ELSE 'workday'
       END AS day_type
FROM sakila.rental"""
data = pd.read_sql_query(query, engine)
data

       rental_id         rental_date month weekday day_type
0              1 2005-05-24 22:53:30     M       W  workday
1              2 2005-05-24 22:54:33     M       W  workday
2              3 2005-05-24 23:03:39     M       W  workday
3              4 2005-05-24 23:04:41     M       W  workday
4              5 2005-05-24 23:05:21     M       W  workday
...          ...                 ...   ...     ...      ...
16039      13486 2006-02-14 15:16:03     M       W  workday
16040      15966 2006-02-14 15:16:03     M       W  workday
16041      11676 2006-02-14 15:16:03     M       W  workday
16042      14616 2006-02-14 15:16:03     M       W  workday
16043      11739 2006-02-14 15:16:03     M       W  workday

[16044 rows x 5 columns]

3. Get all films with ARMAGEDDON in the title.

In [56]:
query = "SELECT title FROM sakila.film WHERE title LIKE '%%ARMAGEDDON%%'"
data = pd.read_sql_query(query, engine)
data

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

4. Get 10 the longest films.

In [62]:
query = """SELECT title, length as Duration from sakila.film
ORDER BY length DESC"""
data = pd.read_sql_query(query, engine)
data.head(30)

                 title  Duration
0        CHICAGO NORTH       185
1       CONTROL ANTHEM       185
2       DARN FORRESTER       185
3          GANGS PRIDE       185
4            HOME PITY       185
5        MUSCLE BRIGHT       185
6         POND SEATTLE       185
7   SOLDIERS EVOLUTION       185
8    SWEET BROTHERHOOD       185
9         WORST BANGER       185
10   CONSPIRACY SPIRIT       184
11    CRYSTAL BREAKING       184
12      KING EVOLUTION       184
13     MOONWALKER FOOL       184
14     SMOOCHY CONTROL       184
15      SONS INTERVIEW       184
16      SORORITY QUEEN       184
17      THEORY MERMAID       184
18       CATCH AMISTAD       183
19      FRONTIER CABIN       183
20       SCALAWAG DUCK       183
21           WIFE TURN       183
22      YOUNG LANGUAGE       183
23     BAKED CLEOPATRA       182
24       MONSOON CAUSE       182
25       RECORDS ZORRO       182
26          REDS POCUS       182
27         SATURN NAME       182
28      SEARCHERS WAIT       182
29    ANALYZE HOOSIERS       181

5. How many films include Behind the Scenes content?

In [70]:
query = """SELECT COUNT(*) as Behind_scenes FROM sakila.film
WHERE special_features LIKE '%%Behind%%Scenes%%'"""
data = pd.read_sql_query(query, engine)
data

   Behind_scenes
0            538

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [73]:
query = """SELECT rating, AVG(length) as Average FROM sakila.film
GROUP BY rating
HAVING AVG(length) > 120"""
data = pd.read_sql_query(query, engine)
data

  rating   Average
0  PG-13  120.4439

7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [74]:
query = """SELECT title, length, row_number() OVER (ORDER BY count(length)) as Ranking FROM sakila.film
WHERE length IS NOT NULL AND length != 0
GROUP BY title, length"""
data = pd.read_sql_query(query, engine)
data

                 title  length  Ranking
0     ACADEMY DINOSAUR      86        1
1       ACE GOLDFINGER      48        2
2     ADAPTATION HOLES      50        3
3     AFFAIR PREJUDICE     117        4
4          AFRICAN EGG     130        5
..                 ...     ...      ...
995     YOUNG LANGUAGE     183      996
996         YOUTH KICK     179      997
997       ZHIVAGO CORE     105      998
998  ZOOLANDER FICTION     101      999
999          ZORRO ARK      50     1000

[1000 rows x 3 columns]